from utils import *

GetServerIconByID = {
	1: '<:phoenix:1200837561204080741>',
	2: '<:tucson:1200837584297934848>',
	3: '<:scottdale:1200837599128977519>',
	4: '<:chandler:1200837614224281660>',
	5: '<:brainburg:1201913774102028369>',
	6: '<:saintrose:1201913801344307251>',
	7: '<:mesa:1201913841613815858>',
	8: '<:redrock:1201913881795252225>',
	9: '<:yuma:1201913911960674346>',
	10: '<:surprise:1201913938908807249>',
	11: '<:prescott:1201914022841032744>',
	12: '<:glendale:1201914057595301929>',
	13: '<:kingman:1201914087869788171>',
	14: '<:winslow:1201914121147392112>',
	15: '<:payson:1201914148003532920>',
	16: '<:gilbert:1201914252839882833>',
	17: '<:showlow:1201914287896141895>',
	18: '<:casegrande:1201914310591250453>',
	19: '<:page:1201914338798211134>',
	20: '<:suncity:1201914361065775165>',
	21: '',
 	22: '',
	23: '<:holiday:1201914903334752256>',
 	24: '',
	25: '<:yava:1201917750390292550>',
	26: '<:faraway:1201914958451843083>',
	27: '<:bumblebee:1201915281190953001>',
	28: '<:christmas:1201915330146865152>'
}

GetServerNameByID = {
    1: 'Phoenix [1]',
	2: 'Tucson [2]',
	3: 'Scottdale [3]',
	4: 'Chandler [4]',
	5: 'Brainburg [5]',
	6: 'Saint Rose [6]',
	7: 'Mesa [7]',
	8: 'Red Rock [8]',
	9: 'Yuma [9]',
	10: 'Surprise [10]',
	11: 'Prescott [11]',
	12: 'Glendale [12]',
	13: 'Kingman [13]',
	14: 'Winslow [14]',
	15: 'Payson [15]',
	16: 'Gilbert [16]',
	17: 'Show Low [17]',
	18: 'Casa Grande [18]',
	19: 'Page [19]',
	20: 'Sun City [20]',
	21: 'Queen Creek [21]',
    22: 'Sedona [22]',
    23: 'Holiday [23]',
    24: 'Wednesday [24]',
	25: 'Yava [25]',
	26: 'Faraway [26]',
	27: 'Bumble Bee [27]',
	28: 'Christmas [28]'
}

GetMobileServerIconByID = {
	1: '<:101:1215615356270551050>',
	2: '<:102:1215615358241742899>',
	3: '<:103:1215615360494211092>'
}

GetProjectIconByName = {
	'Arizona RP': '<:logo_arz:1216013886109646899>',
	'Arizona Mobile': '<:logo_mobile:1215627882026504252>'
}

GetFractionNameByID = {
    1: 'LSPD',
    2: 'RCSD',
    3: 'FBI',
    4: 'SFPD',
    5: 'Больница ЛС',
    6: 'Правительство',
    7: 'ТСР',
    8: 'Больница СФ',
    9: 'Лицензиоры',
    10: 'СМИ ЛС',
    11: 'Groove Street',
    12: 'Vagos',
    13: 'Ballas',
    14: 'Aztecas',
    15: 'The Rifa',
    16: 'Russian Mafia',
    17: 'Yakuza',
    18: 'LCN',
    19: 'Warlock MC',
    20: 'Армия ЛС',
    21: 'None',
    22: 'Больница ЛВ',
    23: 'LVPD',
    24: 'СМИ ЛВ',
    25: 'Night Wolfs',
    26: 'СМИ СФ',
    27: 'Армия СФ',
    28: 'None',
    29: 'СТК',
    30: 'TRB',
    31: 'Больница Jefferson',
    101: 'Юстиция',
    102: 'Оборона',
    103: 'Здравоохранение'
}

GetFractionLogNameByID = {
    1: 'LSMC',
    3: 'LVMC'
}

GetFullFractionNameByID = {
    0: 'Не указано',
    1: 'Министерства Юстиции',
    2: 'Министерства Обороны',
    3: 'Министерства Здравоохранения',
    4: 'Центрального Управления',
    5: 'Министерства СМИ',
    6: 'ТСР'
}

GetJobNameByID = {
    0: 'Нету',
    1: 'Следящий',
    2: 'Старший Следящий',
    3: 'ЗГС',
    4: 'Главный Следящий',
    5: 'Руководство ГОС'
}

GetLogType = {
    0: 'использовал команду',
    1: 'изменил параметры Лидера',
    2: 'изменил параметры Зама',
    3: 'изменил параметры Министра'
}